Hello @cristicalin @oomichi 
This change seems to have breaking changing for me. I have created a cluster using release version v2.18.0 and now using master it wants to recreate my nodes. 

Here is the diff after i ran terraform plan
```terraform
-/+ resource "openstack_compute_instance_v2" "k8s_master_no_floating_ip" {
      ~ access_ip_v4        = "185.189.29.87" -> (known after apply)
      ~ access_ip_v6        = "[2a0a:bcc0:40::4c3]" -> (known after apply)
      ~ all_metadata        = {
          - "depends_on"       = " "
          - "kubespray_groups" = "etcd,kube_control_plane,,k8s_cluster,no_floating"
          - "ssh_user"         = "ubuntu"
          - "use_access_ip"    = "1"
        } -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ flavor_name         = "lb.medium.1d" -> (known after apply)
      ~ id                  = "4ea7c17f-b6e8-40ad-b341-cd1440e117f1" -> (known after apply)
      ~ image_name          = "ubuntu-20.04" -> (known after apply)
        name                = "wallace-sc-k8s-master-nf-3"
      ~ region              = "sto1" -> (known after apply)
      ~ security_groups     = [
          - "wallace-sc-k8s",
          - "wallace-sc-k8s-master",
        ] -> (known after apply)
      - tags                = [] -> null
        # (8 unchanged attributes hidden)

      ~ network {
          ~ fixed_ip_v4    = "185.189.29.87" -> (known after apply)
          ~ fixed_ip_v6    = "[2a0a:bcc0:40::4c3]" -> (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:7f:bc:70" -> (known after apply)
          ~ name           = "public" -> (known after apply)
          + port           = (known after apply) # forces replacement
          ~ uuid           = "b19680b3-c00e-40f0-ad77-4448e81ae226" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      - scheduler_hints {
          - additional_properties = {} -> null
          - different_cell        = [] -> null
          - different_host        = [] -> null
          - group                 = "c13b67ec-3142-446d-b9af-b7139b80412b" -> null
          - query                 = [] -> null
          - same_host             = [] -> null
        }
      + scheduler_hints {
          + different_cell = []
          + different_host = []
          + group          = "c13b67ec-3142-446d-b9af-b7139b80412b"
          + query          = []
          + same_host      = []
        }
    }
```

